﻿﻿﻿﻿﻿﻿﻿﻿﻿//**************************************************************************
//**************************************************************************
//**                                                                      **
//**        (C)Copyright 1985-2018, American Megatrends, Inc.             **
//**                                                                      **
//**                       All Rights Reserved.                           **
//**                                                                      **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093            **
//**                                                                      **
//**                       Phone: (770)-246-8600                          **
//**                                                                      **
//**************************************************************************
//**************************************************************************

//**************************************************************************
//<AMI_FHDR_START>
//
// Name:	Gnb.uni
//
// Description:	GNB String definitions.
//
//<AMI_FHDR_END>
//**************************************************************************
/=#
#include "VFR.uni"

#ifndef x-AMI
#langdef   x-AMI "x-AMI"    // AMI Configuration Language
#endif

#string STR_PRI_VIDEO_PROMPT            #language eng "Primary Video Device"
#language x-AMI "GNB001"
#string STR_PRI_VIDEO_HELP              #language eng "Select Primary Video Device That BIOS Will Use To For Output."
#string STR_IGD_GRFX                    #language eng "IGD Video"
#string STR_NB_PCIE_GRFX                #language eng "NB PCIe Slot Video"

#string STR_GNB_TITLE                       #language eng   "GNB Options"
#string STR_GNB_COMMON_STRING               #language eng   "COMMON"

#string STR_GFX_SUBMENU_STRING              #language eng   "GFX Configuration"
#string STR_INTEGRATED_GRAPHICS_CONTRL      #language eng   "Integrated Graphics"
#language x-AMI "GNB002"
#string STR_INTEGRATED_GRAPHICS_CONTRL_HELP #language eng   "Enable Integrate Graphics Controller"
#string STR_FORCE_TEXT                      #language eng   "Force"
#string STR_UMA_FB_SIZE_STRING              #language eng   "UMA Frame Buffer Size"
#language x-AMI "GNB003"
#string STR_UMA_FB_SIZE_HELP                #language eng   "Set UMA FB Size"
#string STR_UMA_32_TEXT                     #language eng   "32M"
#string STR_UMA_64_TEXT                     #language eng   "64M"
#string STR_UMA_128_TEXT                    #language eng   "128M"
#string STR_UMA_256_TEXT                    #language eng   "256M"
#string STR_UMA_384_TEXT                    #language eng   "384M"
#string STR_UMA_512_TEXT                    #language eng   "512M"
#string STR_UMA_1G_TEXT                     #language eng   "1G"
#string STR_UMA_2G_TEXT                     #language eng   "2G"
#string STR_UMA_4G_TEXT                     #language eng   "4G"


#string STR_BLANK_STRING                    #language    eng    " "
#string STR_DISABLED_TEXT                   #language    eng    "Disabled"
#string STR_ENABLED_TEXT                    #language    eng    "Enabled"
#string STR_DEFAULT_TEXT                    #language    eng    "Default"

#string STR_PCIE_SUBMENU_STRING             #language eng   "PCIE Configuration"
#string STR_PSPP_POLICY_STRING              #language eng   "PSPP Policy"
#language x-AMI "GNB004"
#string STR_PSPP_POLICY_HELP                #language eng   "PCIe Speed Power Policy"
#string STR_PERFORMANCE_STRING              #language eng   "Performance"
#string STR_BALANCED_HIGH_STRING            #language eng   "Balanced-High"
#string STR_BALANCED_LOW_STRING             #language eng   "Balanced-Low"
#string STR_POWER_SAVING_STRING             #language eng   "Power Saving"


#string STR_GFX_HD_AUDIO_PROMPT          #language eng "GFX HD Audio Controller"
#language x-AMI "GNB005"
#string STR_GFX_HD_AUDIO_PROMPT_HELP     #language eng "Enable/Disable GFX HD Audio Controller"
#string STR_INTERNAL_GRAPHICS_PROMPT        #language eng   "Internal Graphics Mode"
#string STR_UMA                             #language eng   "UMA"
#string STR_HELP                            #language eng   "..."

#string STR_IOMMU                           #language eng   "IOMMU"
#language x-AMI "GNB006"
#string STR_IOMMU_HELP                      #language eng   "Enable/Disable IOMMU Support"
#string STR_AWD                             #language eng   "Remote Display Feature"
#language x-AMI "GNB007"
#string STR_AWD_HELP                        #language eng   "Enable/Disable Remote Display Feature Support"
#string STR_HDAUDIO                         #language eng   "Gnb Hd Audio"
#language x-AMI "GNB008"
#string STR_HDAUDIO_HELP                    #language eng   "Enable/Disable Gnb Hd Audio Support"

#string STR_CONTROL_BY_VBIOS            #language eng "Control By VBIOS"
#string STR_CONTROL_BY_DRIVER           #language eng "Control By Driver"

#string STR_VBIOS_VERSION               #language eng   ""

#string STR_MANUALLY_TEXT               #language eng "Manually"
#string STR_DISPLAY_DEVICE_CRT_TEXT     #language eng "CRT"
#string STR_DISPLAY_DEVICE_LCD_TEXT     #language eng "LCD"
#string STR_DISPLAY_DEVICE_CRT2_TEXT    #language eng "CRT2"
#string STR_DISPLAY_DEVICE_DFP1_TEXT    #language eng "DFP1"
#string STR_DISPLAY_DEVICE_DFP2_TEXT    #language eng "DFP2"
#string STR_DISPLAY_DEVICE_DFP3_TEXT    #language eng "DFP3"
#string STR_DISPLAY_DEVICE_DFP4_TEXT    #language eng "DFP4"
#string STR_DISPLAY_DEVICE_DFP5_TEXT    #language eng "DFP5"
#string STR_DISPLAY_DEVICE_DFP6_TEXT    #language eng "DFP6"
#string STR_DISPLAY_DEVICE_DFP7_TEXT    #language eng "DFP7"
#string STR_AMD_PLATFORM_TO_DRIVER_CONTROL           #language eng   "IGD - AmdGop Output Priority"
#language x-AMI "GNB009"
#string STR_AMD_PLATFORM_TO_DRIVER_CONTROL_HELP      #language eng   "Sample Code"
#string STR_AMD_PLATFORM_TO_DRIVER_CONTROL_DATA1     #language eng   "  Priority1"
#language x-AMI "GNB00A"
#string STR_AMD_PLATFORM_TO_DRIVER_CONTROL_DATA2     #language eng   "  Priority2"
#language x-AMI "GNB00B"
#string STR_AMD_PLATFORM_TO_DRIVER_CONTROL_DATA3     #language eng   "  Priority3"
#language x-AMI "GNB00C"
#string STR_AMD_PLATFORM_TO_DRIVER_CONTROL_DATA4     #language eng   "  Priority4"
#language x-AMI "GNB00D"
#string STR_AMD_PLATFORM_TO_DRIVER_CONTROL_DATA5     #language eng   "  Priority5"
#language x-AMI "GNB00E"
#string STR_AMD_PLATFORM_TO_DRIVER_CONTROL_DATA6     #language eng   "  Priority6"
#language x-AMI "GNB00F"
#string STR_AMD_PLATFORM_TO_DRIVER_CONTROL_DATA_HELP #language eng   "For Multi Connector Display Priority"
#string STR_GOP_BOOTUP_LEVEL          #language eng   "IGD - AmdGop Bootup Brightness Level"
#language x-AMI "GNB00G"
#string STR_GOP_BOOTUP_LEVEL_HELP     #language eng   "Lcd Only, Range 0 - 255"

//**************************************************************************
//**************************************************************************
//**                                                                      **
//**        (C)Copyright 1985-2018, American Megatrends, Inc.             **
//**                                                                      **
//**                       All Rights Reserved.                           **
//**                                                                      **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093            **
//**                                                                      **
//**                       Phone: (770)-246-8600                          **
//**                                                                      **
//**************************************************************************
//**************************************************************************